Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: أولئك لهم جنات عدن تجري من تحتهم الأنهار يحلون فيها من أساور من ذهب ويلبسون ثيابا خضرا من سندس وإستبرق متكئين فيها على الأرائك نعم الثواب وحسنت مرتفقا
en: These! For them will be 'Adn (Eden) Paradise (everlasting Gardens); wherein rivers flow underneath them; therein they will be adorned with bracelets of gold, and they will wear green garments of fine and thick silk. They will recline therein on raised thrones. How good is the reward, and what an excellent Murtafaq (dwelling, resting place.)!

source: واضرب لهم مثلا رجلين جعلنا لأحدهما جنتين من أعناب وحففناهما بنخل وجعلنا بينهما زرعا
en: And put forward to them the example of two men: unto one of them We had given two gardens of grapes, and We had surrounded both with date-palms; and had put between them green crops (cultivated fields).

source: كلتا الجنتين آتت أكلها ولم تظلم منه شيئا وفجرنا خلالهما نهرا
en: Each of those two gardens brought forth its produce, and failed not in the least therein, and We caused a river to gush forth in the midst of them.

source: وكان له ثمر فقال لصاحبه وهو يحاوره أنا أكثر منك مالا وأعز نفرا
en: And he had property (or fruit) and he said to his companion, in the course of mutual talk: "I am more than you in wealth and stronger in respect of men." (Tafsir Al-Qurtubi).

source: ودخل جنته وهو ظالم لنفسه قال ما أظن أن تبيد هذه أبدا
en: And he went into his garden while in a state (of pride and disbelief) unjust to himself. He said: "I think not that this will ever perish.

source: وما أظن الساعة قائمة ولئن رددت إلى ربي لأجدن خيرا منها منقلبا
en: "And I think not the Hour will ever come, and if indeed I am brought back to my Lord, (on the Day of Resurrection), I surely shall find better than this when I return to Him."

source: قال له صاحبه وهو يحاوره أكفرت بالذي خلقك من تراب ثم من نطفة ثم سواك رجلا
en: His companion said to him during the talk with him: "Do you disbelieve in Him Who created you out of dust (i.e. your father Adam), then out of Nutfah (mixed semen drops of male and female discharge), then fashioned you into a man?

source: لكنا هو الله ربي ولا أشرك بربي أحدا
en: "But as for my part, (I believe) that He is Allah, my Lord, and none shall I associate as partner with my Lord.

source: ولولا إذ دخلت جنتك قلت ما شاء الله لا قوة إلا بالله إن ترن أنا أقل منك مالا وولدا
en: "It was better for you to say, when you entered your garden: 'That which Allah wills (will come to pass)! There is no power but with Allah !' If you see me less than you in wealth, and children,

source: فعسى ربي أن يؤتين خيرا من جنتك ويرسل عليها حسبانا من السماء فتصبح صعيدا زلقا
en: "It may be that my Lord will give me something better than your garden, and will send on it Husban (torment, bolt) from the sky, then it will be a barren slippery earth.

source: أو يصبح ماؤها غورا فلن تستطيع له طلبا
en: "Or the water thereof (of the gardens) becomes deep-sunken (underground) so that you will never be able to seek it."

source: وأحيط بثمره فأصبح يقلب كفيه على ما أنفق فيها وهي خاوية على عروشها ويقول يا ليتني لم أشرك بربي أحدا
en: So his fruits were encircled (with ruin). And he remained clapping his hands (with sorrow) over what he had spent upon it, while it was all destroyed on its trellises, and he could only say: "Would that I had ascribed no partners to my Lord!" [Tafsir Ibn Kathir]

source: ولم تكن له فئة ينصرونه من دون الله وما كان منتصرا
en: And he had no group of men to help him against Allah, nor could he defend (or save) himself.

source: هنالك الولاية لله الحق هو خير ثوابا وخير عقبا
en: There (on the Day of Resurrection), Al-Walayah (protection, power, authority and kingdom) will be for Allah (Alone), the True God. He (Allah) is the Best for reward and the Best for the final end. (La ilaha illallah- none has the right to be worshipped but Allah).

source: واضرب لهم مثل الحياة الدنيا كماء أنزلناه من السماء فاختلط به نبات الأرض فأصبح هشيما تذروه الرياح وكان الله على كل شيء مقتدرا
en: And put forward to them the example of the life of this world: it is like the water (rain) which We send down from the sky, and the vegetation of the earth mingles with it, and becomes fresh and green. But (later) it becomes dry and broken pieces, which the winds scatter. And Allah is Able to do everything.

source: المال والبنون زينة الحياة الدنيا والباقيات الصالحات خير عند ربك ثوابا وخير أملا
en: Wealth and children are the adornment of the life of this world. But the good righteous deeds, that last, are better with your Lord for rewards and better in respect of hope.

source: ويوم نسير الجبال وترى الأرض بارزة وحشرناهم فلم نغادر منهم أحدا
en: And (remember) the Day We shall cause the mountains to pass away (like clouds of dust), and you will see the earth as a levelled plain, and we shall gather them all together so as to leave not one of them behind.

source: وعرضوا على ربك صفا لقد جئتمونا كما خلقناكم أول مرة بل زعمتم ألن نجعل لكم موعدا
en: And they will be set before your Lord in (lines as) rows, (and Allah will say): "Now indeed, you have come to Us as We created you the first time. Nay, but you thought that We had appointed no meeting for you (with Us)."

source: ووضع الكتاب فترى المجرمين مشفقين مما فيه ويقولون يا ويلتنا مال هذا الكتاب لا يغادر صغيرة ولا كبيرة إلا أحصاها ووجدوا ما عملوا حاضرا ولا يظلم ربك أحدا
en: And the Book (one's Record) will be placed (in the right hand for a believer in the Oneness of Allah, and in the left hand for a disbeliever in the Oneness of Allah), and you will see the Mujrimun (criminals, polytheists, sinners), fearful of that which is (recorded) therein. They will say: "Woe to us! What sort of Book is this that leaves neither a small thing nor a big thing, but has recorded it with numbers!" And they will find all that they did, placed before them, and your Lord treats no one with injustice.

source: وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس كان من الجن ففسق عن أمر ربه أفتتخذونه وذريته أولياء من دوني وهم لكم عدو بئس للظالمين بدلا
en: And (remember) when We said to the angels: "Prostrate yourselves unto Adam." So they prostrated themselves except Iblis (Satan). He was one of the jinn; he disobeyed the Command of his Lord. Will you then take him (Iblis) and his offspring as protectors and helpers rather than Me while they are enemies to you? What an evil is the exchange for the Zalimun (polytheists, and wrong-doers).

source: ما أشهدتهم خلق السماوات والأرض ولا خلق أنفسهم وما كنت متخذ المضلين عضدا
en: I (Allah) made them (Iblis and his offspring) not to witness (nor took their help in) the creation of the heavens and the earth and not (even) their own creation, nor was I (Allah) to take the misleaders as helpers.

source: ويوم يقول نادوا شركائي الذين زعمتم فدعوهم فلم يستجيبوا لهم وجعلنا بينهم موبقا
en: And (remember) the Day He will say: "Call those (so-called) partners of Mine whom you pretended." Then they will cry unto them, but they will not answer them, and We shall put a Maubiq (barrier) between them.

source: ورأى المجرمون النار فظنوا أنهم مواقعوها ولم يجدوا عنها مصرفا
en: And the Mujrimun (criminals, polytheists, sinners) shall see the Fire and apprehend that they have to fall therein. And they will find no way of escape from there.

source: ولقد صرفنا في هذا القرآن للناس من كل مثل وكان الإنسان أكثر شيء جدلا
en: And indeed We have put forth every kind of example in this Qur'an, for mankind. But, man is ever more quarrelsome than anything.

source: وما منع الناس أن يؤمنوا إذ جاءهم الهدى ويستغفروا ربهم إلا أن تأتيهم سنة الأولين أو يأتيهم العذاب قبلا
en: And nothing prevents men from believing, (now) when the guidance (the Qur'an) has come to them, and from asking Forgiveness of their Lord, except that the ways of the ancients be repeated with them (i.e. their destruction decreed by Allah), or the torment be brought to them face to face?

source: وما نرسل المرسلين إلا مبشرين ومنذرين ويجادل الذين كفروا بالباطل ليدحضوا به الحق واتخذوا آياتي وما أنذروا هزوا
en: And We send not the Messengers except as givers of glad tidings and warners. But those who disbelieve, dispute with false argument, in order to refute the truth thereby. And they treat My Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), and that with which they are warned, as a jest and mockery!

source: ومن أظلم ممن ذكر بآيات ربه فأعرض عنها ونسي ما قدمت يداه إنا جعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرا وإن تدعهم إلى الهدى فلن يهتدوا إذا أبدا
en: And who does more wrong than he who is reminded of the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of his Lord, but turns away from them, forgetting what (deeds) his hands have sent forth. Truly, We have set veils over their hearts lest they should understand this (the Qur'an), and in their ears, deafness. And if you (O Muhammad صلى الله عليه وسلم) call them to guidance, even then they will never be guided.

source: وربك الغفور ذو الرحمة لو يؤاخذهم بما كسبوا لعجل لهم العذاب بل لهم موعد لن يجدوا من دونه موئلا
en: And your Lord is Most Forgiving, Owner of Mercy. Were He to call them to account for what they have earned, then surely, He would have hastened their punishment. But they have their appointed time, beyond which they will find no escape.

source: وتلك القرى أهلكناهم لما ظلموا وجعلنا لمهلكهم موعدا
en: And these towns (population, - 'Ad, Thamud) We destroyed them when they did wrong. And We appointed a fixed time for their destruction.

source: وإذ قال موسى لفتاه لا أبرح حتى أبلغ مجمع البحرين أو أمضي حقبا
en: And (remember) when Musa (Moses) said to his boy-servant: "I will not give up (travelling) until I reach the junction of the two seas or (until) I spend years and years in travelling."

source: فلما بلغا مجمع بينهما نسيا حوتهما فاتخذ سبيله في البحر سربا
en: But when they reached the junction of the two seas, they forgot their fish, and it took its way through the sea as in a tunnel.

source: فلما جاوزا قال لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا نصبا
en: So when they had passed further on (beyond that fixed place), Musa (Moses) said to his boy-servant: "Bring us our morning meal; truly, we have suffered much fatigue in this, our journey."

source: قال أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره واتخذ سبيله في البحر عجبا
en: He said: "Do you remember when we betook ourselves to the rock? I indeed forgot the fish; none but Shaitan (Satan) made me forget to remember it. It took its course into the sea in a strange (way)!"

source: قال ذلك ما كنا نبغ فارتدا على آثارهما قصصا
en: [Musa (Moses)] said: "That is what we have been seeking." So they went back retracing their footsteps.

source: فوجدا عبدا من عبادنا آتيناه رحمة من عندنا وعلمناه من لدنا علما
en: Then they found one of Our slaves, on whom We had bestowed mercy from Us, and whom We had taught knowledge from Us.

source: قال له موسى هل أتبعك على أن تعلمن مما علمت رشدا
en: Musa (Moses) said to him (Khidr): "May I follow you so that you teach me something of that knowledge (guidance and true path) which you have been taught (by Allah)?"

source: قال إنك لن تستطيع معي صبرا
en: He (Khidr) said: "Verily you will not be able to have patience with me!

source: وكيف تصبر على ما لم تحط به خبرا
en: "And how can you have patience about a thing which you know not?"

source: قال ستجدني إن شاء الله صابرا ولا أعصي لك أمرا
en: Musa (Moses) said: "If Allah wills, you will find me patient, and I will not disobey you in aught."

source: قال فإن اتبعتني فلا تسألني عن شيء حتى أحدث لك منه ذكرا
en: He (Khidr) said: "Then, if you follow me, ask me not about anything till I myself mention of it to you."

source: فانطلقا حتى إذا ركبا في السفينة خرقها قال أخرقتها لتغرق أهلها لقد جئت شيئا إمرا
en: So they both proceeded, till, when they embarked the ship, he (Khidr) scuttled it. Musa (Moses) said: "Have you scuttled it in order to drown its people? Verily, you have committed a thing "Imr" (a Munkar - evil, bad, dreadful thing)."

source: قال ألم أقل إنك لن تستطيع معي صبرا
en: He (Khidr) said: "Did I not tell you, that you would not be able to have patience with me?"

source: قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا
en: [Musa (Moses)] said: "Call me not to account for what I forgot, and be not hard upon me for my affair (with you)."

source: فانطلقا حتى إذا لقيا غلاما فقتله قال أقتلت نفسا زكية بغير نفس لقد جئت شيئا نكرا
en: Then they both proceeded, till they met a boy, and he (Khidr) killed him. Musa (Moses) said: "Have you killed an innocent person who had killed none? Verily, you have committed a thing Nukr (a great Munkar - prohibited, evil, dreadful thing)!"

source: قال ألم أقل لك إنك لن تستطيع معي صبرا
en: (Khidr) said: "Did I not tell you that you can have no patience with me?"

source: قال إن سألتك عن شيء بعدها فلا تصاحبني قد بلغت من لدني عذرا
en: [Musa (Moses)] said: "If I ask you anything after this, keep me not in your company, you have received an excuse from me."

source: فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض فأقامه قال لو شئت لاتخذت عليه أجرا
en: Then they both proceeded, till, when they came to the people of a town, they asked them for food, but they refused to entertain them. Then they found therein a wall about to collapse and he (Khidr) set it up straight. [Musa (Moses)] said: If you had wished, surely, you could have taken wages for it!"

source: قال هذا فراق بيني وبينك سأنبئك بتأويل ما لم تستطع عليه صبرا
en: (Khidr) said: "This is the parting between me and you, I will tell you the interpretation of (those) things over which you were unable to hold patience.

source: أما السفينة فكانت لمساكين يعملون في البحر فأردت أن أعيبها وكان وراءهم ملك يأخذ كل سفينة غصبا
en: "As for the ship, it belonged to Masakin (poor people) working in the sea. So I wished to make a defective damage in it, as there was a king behind them who seized every ship by force.

source: وأما الغلام فكان أبواه مؤمنين فخشينا أن يرهقهما طغيانا وكفرا
en: "And as for the boy, his parents were believers, and we feared lest he should oppress them by rebellion and disbelief.

source: فأردنا أن يبدلهما ربهما خيرا منه زكاة وأقرب رحما
en: "So we intended that their Lord should change him for them for one better in righteousness and nearer to mercy.

source: وأما الجدار فكان لغلامين يتيمين في المدينة وكان تحته كنز لهما وكان أبوهما صالحا فأراد ربك أن يبلغا أشدهما ويستخرجا كنزهما رحمة من ربك وما فعلته عن أمري ذلك تأويل ما لم تسطع عليه صبرا
en: "And as for the wall, it belonged to two orphan boys in the town; and there was under it a treasure belonging to them; and their father was a righteous man, and your Lord intended that they should attain their age of full strength and take out their treasure as a mercy from your Lord. And I did them not of my own accord. That is the interpretation of those (things) over which you could not hold patience."

source: ويسألونك عن ذي القرنين قل سأتلو عليكم منه ذكرا
en: And they ask you about Dhul-Qarnain. Say: "I shall recite to you something of his story."

source: إنا مكنا له في الأرض وآتيناه من كل شيء سببا
en: Verily, We established him in the earth, and We gave him the means of everything.

source: فأتبع سببا
en: So he followed a way.

source: حتى إذا بلغ مغرب الشمس وجدها تغرب في عين حمئة ووجد عندها قوما قلنا يا ذا القرنين إما أن تعذب وإما أن تتخذ فيهم حسنا
en: Until, when he reached the setting place of the sun, he found it setting in a spring of black muddy (or hot) water. And he found near it a people. We (Allah) said (by inspiration): "O Dhul-Qarnain! Either you punish them, or treat them with kindness."

source: قال أما من ظلم فسوف نعذبه ثم يرد إلى ربه فيعذبه عذابا نكرا
en: He said: "As for him (a disbeliever in the Oneness of Allah) who does wrong, we shall punish him, and then he will be brought back unto his Lord, Who will punish him with a terrible torment (Hell).

source: وأما من آمن وعمل صالحا فله جزاء الحسنى وسنقول له من أمرنا يسرا
en: "But as for him who believes (in Allah's Oneness) and works righteousness, he shall have the best reward, (Paradise), and we (Dhul-Qarnain) shall speak unto him mild words (as instructions)."

source: ثم أتبع سببا
en: Then he followed another way,

source: حتى إذا بلغ مطلع الشمس وجدها تطلع على قوم لم نجعل لهم من دونها سترا
en: Until, when he came to the rising place of the sun, he found it rising on a people for whom We (Allah) had provided no shelter against the sun.

source: كذلك وقد أحطنا بما لديه خبرا
en: So (it was)! And We knew all about him (Dhul-Qarnain).

source: حتى إذا بلغ بين السدين وجد من دونهما قوما لا يكادون يفقهون قولا
en: Until, when he reached between two mountains, he found, before (near) them (those two mountains), a people who scarcely understood a word.

source: قالوا يا ذا القرنين إن يأجوج ومأجوج مفسدون في الأرض فهل نجعل لك خرجا على أن تجعل بيننا وبينهم سدا
en: They said: "O Dhul-Qarnain! Verily Ya'juj and Ma'juj (Gog and Magog) are doing great mischief in the land. Shall we then pay you a tribute in order that you might erect a barrier between us and them?"

source: قال ما مكني فيه ربي خير فأعينوني بقوة أجعل بينكم وبينهم ردما
en: He said: "That (wealth, authority and power) in which my Lord had established me is better (than your tribute). So help me with strength (of men), I will erect between you and them a barrier.

source: آتوني زبر الحديد حتى إذا ساوى بين الصدفين قال انفخوا حتى إذا جعله نارا قال آتوني أفرغ عليه قطرا
en: "Give me pieces (blocks) of iron;" then, when he had filled up the gap between the two mountain-cliffs, he said: "Blow;" then when he had made them (red as) fire, he said: "Bring me molten copper to pour over them."

source: فما اسطاعوا أن يظهروه وما استطاعوا له نقبا
en: So they [Ya'juj and Ma'juj (Gog and Magog)] could not scale it or dig through it.

source: قال هذا رحمة من ربي فإذا جاء وعد ربي جعله دكاء وكان وعد ربي حقا
en: (Dhul-Qarnain) said: "This is a mercy from my Lord, but when the Promise of my Lord comes, He shall level it down to the ground. And the Promise of my Lord is ever true."

source: وتركنا بعضهم يومئذ يموج في بعض ونفخ في الصور فجمعناهم جمعا
en: And on that Day [i.e. the Day Ya'juj and Ma'juj (Gog and Magog) will come out], We shall leave them to surge like waves on one another; and the Trumpet will be blown, and We shall collect them (the creatures) all together.

source: وعرضنا جهنم يومئذ للكافرين عرضا
en: And on that Day We shall present Hell to the disbelievers, plain to view -

source: الذين كانت أعينهم في غطاء عن ذكري وكانوا لا يستطيعون سمعا
en: (To) those whose eyes had been under a covering from My Reminder (this Qur'an), and who could not bear to hear (it).

source: أفحسب الذين كفروا أن يتخذوا عبادي من دوني أولياء إنا أعتدنا جهنم للكافرين نزلا
en: Do then those who disbelieved think that they can take My slaves [i.e., the angels, Allah's Messengers, 'Îsa (Jesus), son of Maryam (Mary)] as Auliya' (lords, gods, protectors) besides Me? Verily, We have prepared Hell as an entertainment for the disbelievers (in the Oneness of Allah - Islamic Monotheism) .

source: قل هل ننبئكم بالأخسرين أعمالا
en: Say (O Muhammad صلى الله عليه وسلم): "Shall We tell you the greatest losers in respect of (their) deeds?

source: الذين ضل سعيهم في الحياة الدنيا وهم يحسبون أنهم يحسنون صنعا
en: "Those whose efforts have been wasted in this life while they thought that they were acquiring good by their deeds.

source: أولئك الذين كفروا بآيات ربهم ولقائه فحبطت أعمالهم فلا نقيم لهم يوم القيامة وزنا
en: "They are those who deny the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of their Lord and the Meeting with Him (in the Hereafter). So their works are in vain, and on the Day of Resurrection, We shall assign no weight for them.

source: ذلك جزاؤهم جهنم بما كفروا واتخذوا آياتي ورسلي هزوا
en: "That shall be their recompense, Hell; because they disbelieved and took My Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) and My Messengers by way of jest and mockery.

source: إن الذين آمنوا وعملوا الصالحات كانت لهم جنات الفردوس نزلا
en: "Verily those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous deeds, shall have the Gardens of Al-Firdaus (Paradise) for their entertainment.

source: خالدين فيها لا يبغون عنها حولا
en: "Wherein they shall dwell (forever). No desire will they have for removal therefrom."

source: قل لو كان البحر مدادا لكلمات ربي لنفد البحر قبل أن تنفد كلمات ربي ولو جئنا بمثله مددا
en: Say (O Muhammad صلى الله عليه وسلم to mankind): "If the sea were ink for (writing) the Words of my Lord, surely, the sea would be exhausted before the Words of my Lord would be finished, even if We brought (another sea) like it for its aid."

source: قل إنما أنا بشر مثلكم يوحى إلي أنما إلهكم إله واحد فمن كان يرجو لقاء ربه فليعمل عملا صالحا ولا يشرك بعبادة ربه أحدا
en: Say (O Muhammad صلى الله عليه وسلم): "I am only a man like you. It has been revealed to me that your Ilah (God) is One Ilah (God - i.e. Allah). So whoever hopes for the Meeting with his Lord, let him work righteousness and associate none as a partner in the worship of his Lord."

source: كهيعص
en: Kaf-Ha-Ya-'Ain-Sad. [These letters are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings].

source: ذكر رحمت ربك عبده زكريا
en: (This is) a mention of the mercy of your Lord to His slave Zakariyya (Zachariah).

source: إذ نادى ربه نداء خفيا
en: When he called out his Lord (Allah) a call in secret.

source: قال رب إني وهن العظم مني واشتعل الرأس شيبا ولم أكن بدعائك رب شقيا
en: He said: "My Lord! Indeed my bones have grown feeble, and grey hair has spread on my head, And I have never been unblest in my invocation to You, O my Lord!

source: وإني خفت الموالي من ورائي وكانت امرأتي عاقرا فهب لي من لدنك وليا
en: "And verily I fear my relatives after me, and my wife is barren. So give me from Yourself an heir.

source: يرثني ويرث من آل يعقوب واجعله رب رضيا
en: "Who shall inherit me, and inherit (also) the posterity of Ya'qub (Jacob) (inheritance of the religious knowledge and Prophethood, not of wealth.). And make him, my Lord, one with whom You are Well-Pleased!"

source: يا زكريا إنا نبشرك بغلام اسمه يحيى لم نجعل له من قبل سميا
en: (Allah said) "O Zakariyya (Zachariah)! Verily, We give you the glad tidings of a son, whose name will be Yahya (John). We have given that name to none before (him)."

source: قال رب أنى يكون لي غلام وكانت امرأتي عاقرا وقد بلغت من الكبر عتيا
en: He said: "My Lord! How can I have a son, when my wife is barren, and I have reached the extreme old age."

source: قال كذلك قال ربك هو علي هين وقد خلقتك من قبل ولم تك شيئا
en: He said: "So (it will be). Your Lord says: It is easy for Me. Certainly I have created you before, when you had been nothing!"

source: قال رب اجعل لي آية قال آيتك ألا تكلم الناس ثلاث ليال سويا
en: [Zakariyya (Zachariah)] said: "My Lord! Appoint for me a sign." He said: "Your sign is that you shall not speak unto mankind for three nights, though having no bodily defect."

source: فخرج على قومه من المحراب فأوحى إليهم أن سبحوا بكرة وعشيا
en: Then he came out to his people from Al-Mihrab (a praying place or a private room), and he told them by signs to glorify Allah's Praises in the morning and in the afternoon.

source: يا يحيى خذ الكتاب بقوة وآتيناه الحكم صبيا
en: (It was said to his son): "O Yahya (John)! Hold fast the Scripture [the Taurat (Torah)]." And We gave him wisdom while yet a child.

source: وحنانا من لدنا وزكاة وكان تقيا
en: And (made him) sympathetic to men as a mercy (or a grant) from Us, and pure from sins [i.e. Yahya (John)] and he was righteous,

source: وبرا بوالديه ولم يكن جبارا عصيا
en: And dutiful towards his parents, and he was neither arrogant nor disobedient (to Allah or to his parents).

source: وسلام عليه يوم ولد ويوم يموت ويوم يبعث حيا
en: And Salam (peace) be on him the day he was born, and the day he dies, and the day he will be raised up to life (again)!
